#+STARTUP: indent contents
#+OPTIONS: num:nil toc:nil
*** Run the program
In order to run this you have to "tangle" the code first using =C-c
C-v C-t=.

#+BEGIN_SRC shell :tangle no :results output :exports both
  cd ada
  gnatmake day10
  ./day10
#+END_SRC

#+RESULTS:
: Advent of Code 2021 - Day 10
: The result for Part 1 is  364389
: The result for Part 2 is  2870201088
